---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.#ctor
source: html/ef76ef54-f48c-ca7f-44ae-653f8e486bcd.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.#ctor Method

Initializes a new instance of the VoltageTypeSet class

## Syntax (C#)
```csharp
public VoltageTypeSet()
```